
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвижениеЗапчастей Расход
	Движения.ДвижениеЗапчастей.Записывать = Истина;
	Для Каждого ТекСтрокаИспользованныеЗапчасти Из ИспользованныеЗапчасти Цикл
		Движение = Движения.ДвижениеЗапчастей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Запчасть = ТекСтрокаИспользованныеЗапчасти.Запчасть;
		Движение.Количество = ТекСтрокаИспользованныеЗапчасти.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
